{
  "aufgabe_id": "ea1-parallelität-b",
  "timestamp": "2025-09-14T11:44:27",
  "aufgabe_titel": "Aufgabe ea1-parallelität-b",
  "aufgabe": "Recherchieren Sie zur Vorbereitung auf diese Aufgabe zunächst Amdahls Gesetz und Gustafsons Gesetz! Beachten Sie dabei bitte, dass wir keine Copy & Paste-Lösungen akzeptieren. Fassen Sie die Aussage(n) von Amdahls Gesetz in eigenen Worten zusammen!",
  "musterloesung": "Amdahls Gesetz besagt, dass der serielle Anteil eines Programms die durch Parallelisierung maximal erreichbare Beschleunigung begrenzt. Zwar steigt der Speedup mit dem Anteil parallelisierbarer Programmteile, jedoch wird selbst bei unendlich hoher Anzahl verfügbarer Prozessoren mindestens die Zeit benötigt, die der serielle Anteil erfordert. Da in der Praxis Parallelisierungskosten (durch Kommunikations- und Synchronisationsaufwand) entstehen, steigt ab einer gewissen Anzahl von Prozessoren der Zeitbedarf zur Bearbeitung der Aufgabe sogar wieder.",
  "bewertungskriterien": [
    "Inhaltliche Korrektheit",
    "Vollständigkeit",
    "Struktur",
    "Nachvollziehbarkeit"
  ],
  "antwort": "## Korrekt\n\n### Antwort 1\nAmdahls Gesetz beschreibt, dass die maximale Beschleunigung eines Programms durch die Parallelisierung hauptsächlich von dem seriellen Anteil abhängt. Selbst wenn der parallelisierbare Anteil eines Programms groß ist, erreicht man eine Grenze, weil der serielle Teil immer die Ausführung bremst. In der Realität steigen außerdem die Parallelisierungskosten, weshalb ab einer bestimmten Anzahl von Prozessoren der Zeitaufwand sogar wieder zunehmen kann.\n\n### Antwort 2\nLaut Amdahls Gesetz limitiert der serielle Anteil eines Programms die potenziell erreichbare Geschwindigkeitssteigerung durch Parallelisierung. Egal wie viele Prozessoren vorhanden sind, der serielle Anteil bleibt immer ein Flaschenhals. Außerdem verursachen viele Prozessoren zusätzlichen Kommunikationsaufwand, was die Effizienz verringert und den Gesamtdurchlauf verlängern kann.\n\n## Teilweise inkorrekt\n\n### Antwort 1\nAmdahls Gesetz zeigt, dass der serielle Anteil die maximale Parallelisierung beschränkt. Je mehr Prozessoren, desto schneller läuft ein Programm, aber nur bis zu einem gewissen Punkt. Danach verbessert zusätzliche Hardware nichts mehr, sondern kann sogar Diamantel kosten, was es ineffizient macht.\n\n### Antwort 2\nAmdahls Gesetz besagt, dass bei der Parallelisierung eines Programms der serielle Anteil die Hauptbegrenzung darstellt. Mit mehr Prozessoren kann das Programm schneller werden, allerdings spielt der parallele Anteil eine größere Rolle. Bei vielen Prozessoren können die Kommunikationskosten jedoch die Vorteile ausgleichen.\n\n## Inkorrekt\n\n### Antwort 1\nAmdahls Gesetz behauptet, dass Programme vollständig parallelisiert werden können, um ihre Laufzeit zu minimieren. Sobald mehr Prozessoren hinzugefügt werden, wird die Verarbeitungsgeschwindigkeit immer schneller, ohne Einschränkungen bei der Effizienz.\n\n### Antwort 2\nNach Amdahls Gesetz gibt es keine Begrenzung für die Parallelisierung eines Programms. Die Anzahl der Prozessoren wirkt sich direkt proportional auf die Leistung aus und der serielle Abschnitt des Programms kann durch zusätzliche Hardware eliminiert werden."
}