[
  {
    "id": "ea1-gefangenendilemma-a",
    "task_type": "ZUORDNUNG",
    "aufgabenstellung": "Ein dem Gefangenendilemma ähnliches Problem ist das sogenannte Lift-Dilemma, das sich wie folgt beschreiben lässt: Zwei Nachbarn (A und B) hören gerne laut bei offenem Fenster Heavy Metal und können sich in ihrem Genuss gegenseitig stören. Folgende Kombinationen sind dabei denkbar:Kombination R: Keiner hört Musik : beide erhalten 3 Genusspunkte,Kombination S: B hört Musik, A nicht : B erhält 8 Genusspunkte, A keinen,Kombination T: A hört Musik, B nicht : A erhält 8 Genusspunkte, B keinen,Kombination P: Beide hören Musik : beide erhalten 1 Genusspunkt.Füllen Sie nachfolgende Entscheidungstabelle aus!",
    "musterloesung":"A ist still, B ist still: R = (3,3) Gesamt: 6, A ist still, B hört Musik: S = (0,8) Gesamt: 8, A hört Musik, B ist still: T = (8,0) Gesamt: 8, A hört Musik, B hört Musik: P = (1,1) Gesamt: 2"
  },
  {
    "id": "ea1-gefangenendilemma-b",
    "task_type": "ZUORDNUNG",
    "aufgabenstellung": "Ein dem Gefangenendilemma ähnliches Problem ist das sogenannte Lift-Dilemma, das sich wie folgt beschreiben lässt: Zwei Nachbarn (A und B) hören gerne laut bei offenem Fenster Heavy Metal und können sich in ihrem Genuss gegenseitig stören. Folgende Kombinationen sind dabei denkbar:Kombination R: Keiner hört Musik : beide erhalten 3 Genusspunkte,Kombination S: B hört Musik, A nicht : B erhält 8 Genusspunkte, A keinen,Kombination T: A hört Musik, B nicht : A erhält 8 Genusspunkte, B keinen,Kombination P: Beide hören Musik : beide erhalten 1 Genusspunkt. Welche Kooperationsstrategie bringt für A und B jeweils über mehrere Runden hinweg den maximalen Nutzen?",
    "musterloesung":"1. Zug: A hört Musik, B ist still, 2. Zug: A ist still, B hört Musik, 3. Zug: A hört Musik, B ist still, 4. Zug: A ist still, B hört Musik, A erhält insgesamt 16 Genusspunkte, B erhält insgesamt 16 Genusspunkte"
  },
  {
    "id": "ea2-topologien",
    "task_type": "ZUORDNUNG",
    "aufgabenstellung": "Bestimmen Sie die Kennzahlen für folgende Topologien:  Quadratisches Gitter mit Knotenzahl n^2, Bus mit n Stationen, Ring mit n Stationen, Ring mit n Stationen und unidirektionalen Verweisen, Stern mit n Stationen, d-dimensionaler Hyperwürfel, Vollständig vermaschtes Netz mit n Stationen, Balancierte Baumstruktur vom Grad k und n Elementen.  Clusterkoeffizient und Durchmesser",
    "musterloesung":"Quadratisches Gitter mit Knotenzahl n^2: Clusterkoeffizient: Kein Nachbar ist direkt mit einem anderen Nachbarn vernetzt. Der globale Clusterkoeffizient hat den Wert 0. Durchmesser: Abstand zweier gegenüberliegender Ecken (Manhattan-Metrik!): 2(n-1);Bus mit n Stationen: Clusterkoeffizient: Hier kann man streiten. • Betrachtet man den Bus als eigene Station (im Sinne einer technischen Einheit), ist kein Knoten direkt mit einem anderen verbunden, sondern jeder nur mit dem Bus. Dann erhält man dasselbe Ergebnis wie beim Stern, also 0. • Betrachtet man den Bus als multiple Kante zwischen allen Stationen, ist jeder mit jedem vernetzt, der Clusterkoeffizient ist also 1. Durchmesser: Es greift dieselbe Argumentation. • Betrachtet man den Bus als eigene Station, ist der maximale Abstand zwischen zwei Knoten n-1. • Betrachtet man den Bus als multiple Kante zwischen allen Stationen, ist jeder mit jedem vernetzt, der Durchmesser ist also 1.;Ring mit n Stationen: Clusterkoeffizient: Kein Nachbar eines Knotens ist direkt mit einem anderen Nachbarn desselben Knotens vernetzt. Der Clusterkoeffizient ist 0. Durchmesser: Die größte Distanz tritt zwischen zwei gegenüberliegenden Knoten auf. Der Durchmesser beträgt n/2.;Ring mit n Stationen und unidirektionalen Verweisen: Clusterkoeffizient: Hier ändert sich nichts, der Clusterkoeffizient ist 0. Durchmesser: Es gibt nur noch eine Richtung durch den Graphen. Jeder Knoten hat zu dem Nachbarn, mit dem er nicht gerichtet verbunden ist, die Distanz von n-1.;Stern mit n Stationen: Clusterkoeffizient: * In der Sternstruktur haben nicht alle Knoten denselben lokalen Clusterkoeffizienten. Die Randknoten haben jeweils nur einen Nachbarn. Dieser hat d mögliche und 0 tatsächliche Verbindungen zu anderen Nachbarn, der lokale Clusterkoeffizient ist 0/0 und damit formal nicht bestimmt. • Versteht man den Clusterkoeffizienten als Maß für Transitivität, erhält man trotzdem für den lokalen Clusterkoeffizienten der Randknoten den Wert 0, sodass der globale Clusterkoeffizient den Wert 0 hat. Durchmesser: Um zwei Randknoten zu verbinden, muss stets durch den Zentrumsknoten vermittelt werden, der Durchmesser ist 2.;d-dimensionaler Hyperwürfel: Clusterkoeffizient: Kein Nachbar eines Knotens ist direkt mit einem anderen Nachbarn desselben Knotens vernetzt. Der Clusterkoeffizient ist 0. Durchmesser: Per Definition des Hyperwürfels: In jeder Dimension ist nur ein Vermittlungsschritt notwendig.;Vollständig vermaschtes Netz mit n Stationen: Clusterkoeffizient: Jeder ist mit jedem vernetzt. Der Clusterkoeffizient hat den Wert 1. Durchmesser: Jeder ist mit jedem vernetzt. Der Durchmesser ist 1.;Balancierter k-närer Baum mit n Elementen: Clusterkoeffizient: Kein Nachbar eines Knotens ist direkt mit einem anderen Nachbarn desselben Knotens vernetzt. Der Clusterkoeffizient ist 0. Durchmesser: Per Definition ist die Höhe des k-nären balancierten Baumes maximal c·log_k(n), wobei c eine Konstante ist. Zwei Blätter, die nur über den Wurzelknoten erreicht werden können, haben demnach den Abstand 2·c·log_k(n).;"
  },
  {
    "id": "ea3-Signalklassifikation",
    "task_type": "ZUORDNUNG",
    "aufgabenstellung": "Tragen Sie die fehlenden Begriffe im nachfolgenden Signalklassifikationsbaum ein:",
    "musterloesung": "von links oben nach rechts unten: stochastisch, deterministisch, nichtstationär, stationär, quasiperiodisch, nichtperiodisch, periodisch"
  },
{
    "id": "ea5-OSI-Schichtenmodell",
    "task_type": "ZUORDNUNG",
    "aufgabenstellung": " Ordnen Sie folgende Aufgaben, Verfahren bzw. Protokolle der richtigen Schicht des OSI-ReferenzModells zu, indem Sie die entsprechende Schichtnummer in die rechte Spalte eintragen:Wegevermittlung, Frame-Bildung, Cookie-Management, Bit-Übertragung, Paketierung, Segmentierung, Ende-zu-Ende-Vermittlung, Dienst-zu-Dienst-Vermittlung, Leitungskodierung, Medienzugriffskontrolle, Network Address Translation, Flusskontrolle, Aufbau & Verwaltung virtueller Verbindungen, Verwaltung von verbindungsunabhängigen Sitzungen, Einheitliche Darstellung von Daten in heterogenen Systemen, CSMA/CD, IP, UDP, TCP, DNS, HTTP, ICMP, Sockets",
    "musterloesung":"Wegevermittlung: Schicht 3 (Vermittlung), Frame-Bildung: Schicht 2 (Sicherung), Cookie-Management: Schicht 5 (Sitzung), Bit-Übertragung: Schicht 1 (Bitübertragung), Paketierung: Schicht 3 (Vermittlung), Segmentierung: Schicht 2 (Sicherung) oder Schicht 4 (Transport, spez. TCP), Ende-zu-Ende-Vermittlung: Schicht 3 (Vermittlung), Dienst-zu-Dienst-Vermittlung: Schicht 4 (Transport), Leitungskodierung: Schicht 1, ggf. noch Schicht 2, Medienzugriffskontrolle: Schicht 2, Network Address Translation: Schicht 3 (Vermittlung), Flusskontrolle: Schicht 2 (Switches) oder Schicht 4 (TCP), Aufbau & Verwaltung virtueller Verbindungen: Schicht 4 (Transport), ggf. Schicht 5 (Sitzung), Verwaltung von verbindungsunabhängigen Sitzungen: Schicht 5 (Sitzung), Einheitliche Darstellung von Daten in heterogenen Systemen: Schicht 6 (Darstellung), CSMA/CD: Schicht 2 (Medienzugriff), IP: Schicht 3 (Vermittlung), UDP: Schicht 4 (Transport), TCP: Schicht 4 (Transport), DNS: Schicht 7 (Anwendung), HTTP: Schicht 7 (Anwendung), ICMP: Schicht 3 (Vermittlung), Sockets: Schicht 4"
  },
  {
    "id": "ea5-Dijkstra-Algorithmus",
    "task_type": "ZUORDNUNG",
    "aufgabenstellung": " Ermitteln Sie mit Hilfe des Dijkstra-Algorithmus die kürzesten Pfade von Knoten A zu den anderen Knoten. Graph:A-B:1, A-D:2, B-C:3, B-E:1, C-D:2, C-F:3, D-G:3, E-F:1, E-H:2, F-G:1, F-I:4, G-J:1, H-I:1, I-J:1 Tragen Sie die Kosten in die Tabelle ein:",
    "musterloesung":"B: 1, A; C: 4, B; D: 2, A; E: 2, B; F: 3, E; G: 4, F; H: 4, E; I: 5, H; J: 5, G"
  }
]