[
  {
    "id": "ea1-parallelität-b",
    "task_type": "FREITEXT",
    "aufgabenstellung": "Recherchieren Sie zur Vorbereitung auf diese Aufgabe zunächst Amdahls Gesetz und Gustafsons Gesetz! Beachten Sie dabei bitte, dass wir keine Copy & Paste-Lösungen akzeptieren. Fassen Sie die Aussage(n) von Amdahls Gesetz in eigenen Worten zusammen!",
    "musterloesung": "Amdahls Gesetz besagt, dass der serielle Anteil eines Programms die durch Parallelisierung maximal erreichbare Beschleunigung begrenzt. Zwar steigt der Speedup mit dem Anteil parallelisierbarer Programmteile, jedoch wird selbst bei unendlich hoher Anzahl verfügbarer Prozessoren mindestens die Zeit benötigt, die der serielle Anteil erfordert. Da in der Praxis Parallelisierungskosten (durch Kommunikations- und Synchronisationsaufwand) entstehen, steigt ab einer gewissen Anzahl von Prozessoren der Zeitbedarf zur Bearbeitung der Aufgabe sogar wieder."
  },
  { 
    "id": "ea1-parallelität-c",
    "task_type": "FREITEXT",
    "aufgabenstellung": "Recherchieren Sie zur Vorbereitung auf diese Aufgabe zunächst Amdahls Gesetz und Gustafsons Gesetz! Beachten Sie dabei bitte, dass wir keine Copy & Paste-Lösungen akzeptieren. Welche Schwachstellen hat Amdahls Gesetz?",
    "musterloesung": "Das Gesetz berücksichtigt nicht, dass weitere beschleunigende Elemente wie bspw. Caches existieren, die den Speedup weiter erhöhen können. Weiterhin geht Amdahl von einer festenProblemgröße aus, d.h. er nimmt an, dass \"nur\" ein festes Problem innerhalb kürzester Zeit zulösen ist. Dass durch die Parallelisierung ggf. komplexere Probleme lösbar werden,berücksichtigt er nicht."
  },
  {
    "id": "ea1-parallelität-e",
    "task_type": "FREITEXT",
    "aufgabenstellung": "Recherchieren Sie zur Vorbereitung auf diese Aufgabe zunächst Amdahls Gesetz und Gustafsons Gesetz! Beachten Sie dabei bitte, dass wir keine Copy & Paste-Lösungen akzeptieren. Fassen Sie nun die Aussage von Gustafsons Gesetz in eigenen Worten zusammen!",
    "musterloesung": "Gustafson dreht im Vergleich zu Amdahl die Zeilsetzung um. Er stellt fest, dass mit wachsender Anzahl von Prozessoren immer größere Aufgaben bewältigt werden können, weil in einer fest vorgegebenen Zeitspanne der Parallelanteil im Verhältnis zum seriellen Anteil immer stärker dominiert. Analog zu Amdahl steigt auch hier der Speedup mit der Anzahl der Prozessoren und dem parallelisierbaren Anteil, ist aber nicht nach oben beschränkt."
  },
  {
    "id": "ea1-parallelität-f",
    "task_type": "FREITEXT",
    "aufgabenstellung": "Recherchieren Sie zur Vorbereitung auf diese Aufgabe zunächst Amdahls Gesetz und Gustafsons Gesetz! Beachten Sie dabei bitte, dass wir keine Copy & Paste-Lösungen akzeptieren. Welche Schwachstellen hat Gustafsons Gesetz?",
    "musterloesung": "Nicht jedes Problem lässt sich beliebig vergrößern. Stattdessen müssen häufig Probleme in fest vorgegebenen zeitlichen Grenzen (sog. Echtzeitbedingunen) gelöst werden. Hier kann Gustafsons Gesetz nicht angewendet werden."
  },
  {
    "id": "ea2-strukturen",
    "task_type": "BEISPIELE",
    "aufgabenstellung": "Im Kurs haben Sie einige Beispiel für Strukturen in Natur und Technik kennengelernt. Nennen Sie fünf weitere Beispiel für Strukturen aus diesen Bereichen:",
    "musterloesung": "Beispiele hierfür sind neben vielen anderen: Das Stromnetz, Drahtgebundenes Telekommunikationsnetz, Ausbreitung ansteckender Krankheiten, Sanddünen in der Wüste, Vogel- und Fischschwärme, Hierarchien in Organisationen oder anderen sozialen Gemeinschaften auch bei Tieren. Dies ist natürlich nur eine kleine Auswahl. In der Korrektur wurden auch weitere Beispiele von Strukturen als richtig gewertet."
  },
  {
    "id": "ea3-Signalklassifikation",
    "task_type": "ZUORDNUNG",
    "aufgabenstellung": "Tragen Sie die fehlenden Begriffe im nachfolgenden Signalklassifikationsbaum ein:",
    "musterloesung": "von links oben nach rechts unten: stochastisch, deterministisch, nichtstationär, stationär, quasiperiodisch, nichtperiodisch, periodisch"
  },
  {
    "id": "ea3-Fourierreihe-1",
    "task_type": "RECHENAUFGABE", 
    "aufgabenstellung": "Bestimmen Sie die Fourierreihe der Dreieckfunktion in reeller Darstellung: $$ \\wedge(t)= \\left\\{ \\begin{array}{cc} 1-|t| & |t|<1 \\\\ 0 & sonst \\\\ \\end{array} \\right. $$ Lösung: a0/2 und Rechenweg/Begründung", 
    "musterloesung": "a0/2 = 0,5; Rechenweg/Begründung: $$\\frac{a_0}{2}$$ lautet: $$\\frac{a_0}{2} =  \\frac{1}{T_0} \\int_{t_0}^{t_0+T_0} x(t) \\, dt$$ Dies entspricht dem arithmetischen Mittel über eine Periode, also im Beispiel genau 0,5."
  },
  {
    "id": "ea3-Fourierreihe-2",
    "task_type": "RECHENAUFGABE", 
    "aufgabenstellung": "Bestimmen Sie die Fourierreihe der Dreieckfunktion in reeller Darstellung: $$ \\wedge(t)= \\left\\{ \\begin{array}{cc} 1-|t| & |t|<1 \\\\ 0 & sonst \\\\ \\end{array} \\right. $$ ak und Rechenweg/Begründung", 
    "musterloesung":"$$a_k = \\frac{2 - 2\\cos(\\pi k)}{\\pi^2 k^2} = \\begin{cases} \\dfrac{2}{\\pi^2 k^2}, & k \\\\ \\text{ungerade} \\\\[6pt] 0, & \\text{sonst} \\end{cases}$$; Rechenweg / Begründung: Die Ausgangsformel lautet $$ a_k = \\frac{2}{T_0} \\int_{t_0}^{t_0+T_0} x(t)\\cos(k\\omega_0 t)\\, dt \\quad$$ mit $$\\quad \\omega_0 = \\frac{2\\pi}{T_0} $$ Im konkreten Fall $(T_0 = 2)$ gilt daher $$ a_k = \\int_{-1}^{1} x(t)\\cos(k \\pi t)\\, dt $$ Aus Symmetriegründen genügt es, nur über eine Dreiecksseite zu integrieren und das Ergebnis zu verdoppeln: $$ a_k = 2 \\int_{0}^{1} (1-t)\\cos(k\\pi t)\\, dt $$ Durch Lösung dieses Integrals über partielle Integration kommt man auf das obenstehende Ergebnis."
  },
  {
    "id": "ea3-Fourierreihe-3",
    "task_type": "RECHENAUFGABE", 
    "aufgabenstellung": "Bestimmen Sie die Fourierreihe der Dreieckfunktion in reeller Darstellung: $$ \\wedge(t)= \\left\\{ \\begin{array}{cc} 1-|t| & |t|<1 \\\\ 0 & sonst \\\\ \\end{array} \\right. $$ bk und Rechenweg/Begründung", 
    "musterloesung":"bk = 0; Rechenweg/Begründung:  Die Dreiecksfunktion ist gerade und kann daher keine ungeraden Schwingungsanteile enthalten."
  },
  {
    "id": "ea3-Abtastung-1-1",
    "task_type": "FORMEL_ZAHL",
    "aufgabenstellung": "Gegeben sei eine periodische Schwingung der Frequenz f0 = 10 Hz. Die Schwingung wird beschrieben durch $$ f(x)=A \\cdot \\sin (2 \\pi f_0 t) $$ Diese Schwingung soll nun abgetastet werden.Wie groß muss die Abtastfrequenz fa mindestens sein, damit das Signal fehlerfrei aus den Abtastwerten wiederhergestellt werden kann?",
    "musterloesung": "fa > 20 Hz"
  },
  {
    "id": "ea3-Abtastung-1-2",
    "task_type": "FREITEXT",
    "aufgabenstellung": "Gegeben sei eine periodische Schwingung der Frequenz f0 = 10 Hz. Die Schwingung wird beschrieben durch $$ f(x)=A \\cdot \\sin (2 \\pi f_0 t) $$ Diese Schwingung soll nun abgetastet werden.Wie groß muss die Abtastfrequenz fa mindestens sein, damit das Signal fehlerfrei aus den Abtastwerten wiederhergestellt werden kann? Begründung",
    "musterloesung": "Begründung: Das Abtasttheorem besagt, dass ein Signal mit mehr als der doppelten im Signal maximal auftretenden Frequenz abgetastet werden muss, um dieses fehlerfrei rekonstruieren zu können. Die maximale (und einzige) Frequenz, die im Signal auftritt, ist 10 Hz, also muss die Abtastfrequenz über 20 Hz liegen."
  },
  {
    "id": "ea4-crc-a",
    "task_type": "FORMEL_ZAHL",
    "aufgabenstellung": "Sie sollen nun die Nachricht 0011 0001 1000 1100 mit Hilfe des CRC-Verfahrens für die Übertragung absichern. Als Generatorpolynom wird G(x)=x^5+x^2+1 (CRC-5) verwendet. Geben Sie zunächst das Informationspolynom I(x) in TeX-Notation (ohne Dollarzeichen) an.",
    "musterloesung": "I(x) = 0·x^15 + 0·x^14 + 1·x^13 + 1·x^12 + 0·x^11 + 0·x^10 + 0·x^9 + 1·x^8 + 1·x^7 + 0·x^6 + 0·x^5 + 0·x^4 + 1·x^3 + 1·x^2 + 0·x^1 + 0·x^0 = x^13 + x^12 + x^8 + x^7 + x^3 + x^2"
  },
  {
    "id": "ea4-crc-d",
    "task_type": "FORMEL_ZAHL",
    "aufgabenstellung": "Sie sollen nun die Nachricht 0011 0001 1000 1100 mit Hilfe des CRC-Verfahrens für die Übertragung absichern. Als Generatorpolynom wird G(x)=x^5+x^2+1 (CRC-5) verwendet. Wie lautet der resultierende CRC Prüfwert (binär)?",
    "musterloesung": "001100011000110011011"
  },
    {
    "id": "ea6-1-b",
    "task_type": "FREITEXT",
    "aufgabenstellung": "Weswegen denken Sie, dass drahtlose Kopfhörer über Bluetooth und nicht über WLAN mit Ihrem Smartphone gekoppelt sind?",
    "musterloesung": "Bluetooth wurde für einen geringen Energieverbrauch konzipiert. Sowohl Smartphone, als auch Kopfhörer selbst können somit den Energieverbrauch reduzieren. Mit WLAN wäre der Energieverbrauch höher. "
  },
  {
    "id": "ea6-2-a",
    "task_type": "FREITEXT",
    "aufgabenstellung": "Das C-Netz nutzte ein digitales Übertragungsverfahren zur Signalisierung von gewählten Telefonnummern oder von anrufen. Weswegen vermuten Sie, dass gerade die Signalisierung digital übertragen wurde? ",
    "musterloesung":" Die Übertragung von Signalisierung (also Steuerdaten) sollte besonders robust funktionieren. Ansonsten wird eine gewählte Nummer falsch interpretiert oder das Mobiltelefon empfängt keine Steuerdaten vom Mobilfunknetzwerk. Eine digitale Übertragung ermöglicht eine geringere Fehleranfälligkeit. Weiterhin ist die Übertragung von Sprache über ein analoges Verfahren einfacher zu realisieren. In der damaligen Zeit war die notwendige Technik noch nicht so fortgeschritten."
  },
  {
    "id": "ea6-2-b",
    "task_type": "FREITEXT",
    "aufgabenstellung": "Was ist der Unterschied von leitungsvermittelnden Verfahren gegenüber paketvermittelnden Verfahren? ",
    "musterloesung":"Bei der Leitungsvermittlung wird zur Übertragung von Daten eine „virtuelle Leitung“ geschalten. Diese Leitung ist explizit für die beiden Kommunikationspartner reserviert. Selbst wenn beide Kommunikationspartner keine Daten senden, ist die Leitung reserviert und wird abgerechnet. Bei der Paketvermittlung wird jedes Datenpaket einzeln vermittelt (geroutet). Kommunizieren zwei Teilnehmer gerade nicht miteinander, kann die frei gewordene Kapazität für andere Datenübertragungen genutzt werden. Da nur die tatsächlich erzeugten Daten vermittelt werden, fallen im Allgemeinen Gebühren auch nur für das übertragene Volumen an."
  },
  {
    "id": "ea6-2-c",
    "task_type": "FREITEXT",
    "aufgabenstellung": "Weswegen wurde in Deutschland UMTS und nicht GSM deaktiviert, obwohl UMTS eine viel höhere Datenübertragungsrate als GSM ermöglicht? ",
    "musterloesung":"Eine große Anzahl an Geräten ist ausschließlich mit GSM kompatibel. Diese Geräte stellen beispielsweise automatische Notruffunktionalität in Autos bereit, erlauben die Abgabe eines Notrufs auf Knopfdruck oder alarmieren in Gebäuden automatisiert Feuerwehr oder Polizei. Diese Geräte lassen sich nicht auf UMTS umrüsten und müssten ersetzt werden. "
  },
  {
    "id": "ea6-3-a",
    "task_type": "FREITEXT",
    "aufgabenstellung": "Weswegen können kleine Zellen in einem zellulären Mobilfunknetzwerk von Vorteil sein?",
    "musterloesung":"Benutzer innerhalb einer Zelle teilen sich die zur Verfügung stehende Bandbreite mit der zugehörigen Basisstation. Je kleiner die Zelle ist, desto weniger Nutzer müssen sich diese Bandbreite teilen. "
  },
  {
    "id": "ea6-3-b",
    "task_type": "FREITEXT",
    "aufgabenstellung": "LTE unterstützte in den ersten Versionen keine Telefonie. Stattdessen wurde der Circuit Switched Fallback (CSFB) eingeführt. Hierbei wechselt das Mobiltelefon bei einem an- oder abkommenden Telefonanruf in das UMTS oder GSM-Netz. Was könnten die Nachteile dieses Verfahrens sein? ",
    "musterloesung":"Lösung: Es könnte sein, dass an dem aktuellen Standort des Mobilfunkteilnehmers zwar LTE zur Verfügung steht, jedoch kein GSM oder UMTS-Empfang möglich ist. Weiterhin könnte das GSM oder UMTS-Netz überlastet sein. Zusätzlich benötigt der Wechsel von einer Technologie zur nächsten viel Zeit: Das Mobiltelefon muss auf eine andere Frequenz wechseln und sich erneut in GSM oder UMTS anmelden."
  },
  {
    "id": "ea6-4-a",
    "task_type": "FREITEXT",
    "aufgabenstellung": "Weswegen ist eine WLAN-Verbindung im Allgemeinen ungeeignet zur Übertragung von Sprache oder einem actionreichem Online-Spiel? ",
    "musterloesung":"In WLAN gibt es keine koordinierte Steuerung von sendenden Teilnehmern. Stattdessen darf jeder Teilnehmer zu jeder Zeit ein Sendefreigabe anfordern. In einem stark ausgelastetem WLANNetz kann also nicht garantiert werden, zu welchem Zeitpunkt eine gegebene Station senden darf."
  },
  {
    "id": "ea6-4-b",
    "task_type": "FREITEXT",
    "aufgabenstellung": "Ist durch das Zugriffsverfahren Collision Avoidance (CA) garantiert, dass es zu keinen Kollisionen beim Senden von Daten kommt? ",
    "musterloesung":"Mit CA ist die Wahrscheinlichkeit einer Kollision reduziert. Garantiert werden kann dies jedoch nicht. Zwei Teilnehmer könnten immer noch zur selben Zeit einen Request to Send (RTS) übertragen."
  },
  {
    "id": "ea6-4-c",
    "task_type": "FREITEXT",
    "aufgabenstellung": "Erläutern Sie das Hidden Station Problem in eigenen Worten und gehen Sie darauf ein, wie dieses Problem in WLAN gelöst wurde ",
    "musterloesung":"Das Hidden Station Problem: Zwei Teilnehmer (A, B) in einem Netzwerk könnten jeweils mit dem Access Point verbunden sein aber so weit voneinander entfernt sein, dass sie sich gegenseitig nicht empfangen können. Das bedeutet, dass Teilnehmer A nicht in Erfahrung bringen kann, ob Teilnehmer B gerade Daten überträgt. Somit weiß Teilnehmer A nicht, ob er selbst gerade Daten senden darf oder nicht. In WLAN wird dieses Problem dadurch gelöst, dass Teilnehmer vor dem Senden von Daten zuerst eine Sendeanforderung übertragen (RTS). Der Access Point beantwortet diese (CTS). Diese Antwort ist von allen Stationen, die mit dem gleichen Access Point verbunden sind empfangbar. Daher werden andere Informationen darüber informiert, dass gerade eine Datenübertragung durch einen anderen Teilnehmer stattfindet."
  },
  {
    "id": "ea6-5-a",
    "task_type": "FREITEXT",
    "aufgabenstellung": "Nennen Sie zwei Vorteile des Adaptive Frequency-Hopping Spread Spectrum Verfahren. ",
    "musterloesung":"Mit diesem Verfahren werden zu sendenden Signalen auf verschiedene Frequenzen verteilt. Hierdurch wird die Störung von anderen Funkverfahren reduziert, da nicht permanent auf einer Frequenz übertragen wird. Gleichzeitig kann sich das Verfahren selbst auf Störungen einstellen. Sind einzelne Frequenzen durch einen anderen Sender belegt, umgeht das Frequency-Hopping-Verfahren diese einzelnen Kanäle."
  },
  {
    "id": "ea6-5-b",
    "task_type": "FREITEXT",
    "aufgabenstellung": "Weswegen wird NFC für die kontaktlose Bezahlung genutzt und nicht Bluetooth? ",
    "musterloesung":"Auch wenn Bluetooth nur wenig Energie benötigt, würde eine EC-Karte dennoch einen Akku zum Senden benötigen. Dies ist nicht praktikabel. Bei NFC kann der Transponder seine Energie vollständig aus dem Signal des Lesegerätes beziehen. Weiterhin hat Bluetooth eine höhere Reichweite. Dies würde verschiedene Angriffsszenarien ermöglichen, da Hacker das Signal aus größerer Entfernung aufzeichnen, manipulieren oder wieder Abspielen könnten."
  },
  {
    "id": "ea6-5-c",
    "task_type": "FREITEXT",
    "aufgabenstellung": "Weswegen befinden sich Satelliten zur Internetanbindung in einem niedrigen Orbit? ",
    "musterloesung":"Der niedrige Orbit verringert die Signallaufzeit. Die Latenz wird hierdurch geringer."
  }

]