[
  {
    "id": "ea2-edge-reassignment-und-small-worlds-1",
    "task_type": "RECHENAUFGABE",
    "aufgabenstellung": " Gegeben sein ein Ring mit N=15 Knoten k1, k2, k3, ..., k15 und d=4. d.h. jeder Knoten ist nicht nur mit seinen direkten Nachbaren, sondern auch mit seinen jeweils übernächsten Nachbarn in beide Richtungen verbunden. Bestimmen Sie den Cluster-Koeffizienten für den Ring.",
    "musterloesung":" Man beachte: Der Knoten, für den der Clusterkoeffizient berechnet werden soll, taucht in der Berechnung selbst gar nicht auf, sondern nur dessen Nachbarn. Jeder Knoten hat 4 direkte Nachbarn. Es gibt somit 6 möglicher Verbindungen (bidirektional).  Der lokale Clusterkoeffizient jedes Knotens ist daher 3/6 = 0,5. Da er für alle Knoten gleich ist, entspricht der Wert gleichzeitig dem globalen Clusterkoeffizienten."
  },
  {
    "id": "ea2-edge-reassignment-und-small-worlds-2",
    "task_type": "RECHENAUFGABE",
    "aufgabenstellung": " Gegeben sein ein Ring mit N=15 Knoten k1, k2, k3, ..., k15 und d=4. d.h. jeder Knoten ist nicht nur mit seinen direkten Nachbaren, sondern auch mit seinen jeweils übernächsten Nachbarn in beide Richtungen verbunden.Ermitteln Sie für den Knoten k1 die mittlere Pfadlänge, indem Sie den Durchschnitt der Pfadlängen zu allen anderen Knoten bestimmen.",
    "musterloesung":"Als Pfadlänge zwischen zwei Knoten wird die minimale Anzahl der Sprünge bezeichnet, die benötigt werden, um von dem einem der beiden Knoten zu dem jeweils anderen zu gelangen. So hat beispielsweise die Pfadlänge zwischen k1 und k8 den Wert 4, der Pfad führt über die Knoten k3, k5 und k7 oder alternativ über die Knoten k3, k5 und k6 .  In Mittel über alle 14 Zielknoten ergibt sich daraus die Pfadlänge Lk1= (1+1+2+2+3+3+4+4+3+3+2+2+1+1)/14 = 16/7"
  },
  {
    "id": "ea2-edge-reassignment-und-small-worlds-3",
    "task_type": "RECHENAUFGABE",
    "aufgabenstellung": "Gegeben sein ein Ring mit N=15 Knoten k1, k2, k3, ..., k15 und d=4. d.h. jeder Knoten ist nicht nur mit seinen direkten Nachbaren, sondern auch mit seinen jeweils übernächsten Nachbarn in beide Richtungen verbunden. Ersetzen Sie nun nach dem Modell von Watts & Strogatz eine Verbindung von k1 so, dass k1 mit k8 verbunden ist. Bestimmen Sie nun erneut die durchschnittliche Pfadlänge von k1 zu den anderen Knoten und vergleichen Sie mit a) (Clusterkoeffizient 3/6 = 0,5.)",
    "musterloesung":"Durch die direkte Verbindung zu k8 verringern sich die Pfadlängen und es ergibt sich: Lk1= (1+1+2+2+3+2+2+1+2+2+3+2+2+1)/14=13/7 Das Edge Reassignment an Knoten 1 verkürzt also die durchschnittliche Pfadlänge von k1 zu den anderen Knoten um 3/16 = 18,75%."
  },
  {
    "id": "ea2-hubs-and-authorities-1",
    "task_type": "RECHENAUFGABE",
    "aufgabenstellung": " Gegeben sei der folgende Graph: 1->2, 2->1, 2->3, 3->1. Bestimmen Sie die Adjazenzmatrix.",
    "musterloesung":"A=[[0,1,0],[1,0,1],[1,0,0]]"
  },
  {
    "id": "ea2-hubs-and-authorities-2",
    "task_type": "RECHENAUFGABE",
    "aufgabenstellung": "Gegeben sei der folgende Graph: 1->2, 2->1, 2->3, 3->1. Bestimmen Sie die Hub- und Authority-Vektoren h und a für die Knoten des Graphen, indem Sie das nachfolgende Eigenvektor-Problem lösen: $$ A \\cdot A^T \\cdot h = m \\cdot h $$ $$ A^T \\cdot A \\cdot a = m \\cdot a $$ Hinweis: Für den Algorithmus ist nur der Eigenvektor zum betragsmäßig größten Eigenwert m zu betrachten. Auszugeben sind Eigenwert m und Rechenweg dazu, Hubvektor h und Rechenweg dazu, Authorityvektor a und Rechenweg dazu",
    "musterloesung":"In dem gegebenen Graphen existieren die gerichteten Kanten 1 → 2, 2 → 1, 2 → 3 und 3 → 1. Daraus ergibt sich die nachfolgende Adjazenzmatrix A und ihre Transponierte A^T, die wir gleich benötigen werden: A = (0 1 0; 1 0 1; 1 0 0), A^T = (0 1 1; 1 0 0; 0 1 0). Der Hubvektor dieses Graphen entspricht dem zum betragsmäßig größten Eigenwert gehörenden Eigenvektor des Matrixproduktes A·A^T aus der Adjazenzmatrix und ihrer Transponierten. Der Authorityvektor ergibt sich entsprechend aus dem Matrixprodukt A^T·A. Das zu lösende Eigenvektorproblem lässt sich also beschreiben durch A·A^T·h = m·h und A^T·A·a = m·a mit A·A^T = (1 0 0; 0 2 1; 0 1 1) und A^T·A = (2 0 1; 0 1 0; 1 0 1). Das charakteristische Polynom P(m) zur Berechnung des Hubvektors h ergibt sich durch Aufstellen der Eigenwertgleichung für A·A^T: P(m) = det(A·A^T - mE) = |1-m 0 0; 0 2-m 1; 0 1 1-m| = -m^3 + 4m^2 - 4m + 1. Die Eigenwerte ergeben sich durch Lösen der Gleichung P(m) = 0. Es ergeben sich drei reelle Eigenwerte: m1 ≈ 0.38, m2 = 1, m3 ≈ 2.62. Der betragsmäßig größte Eigenwert ist m3, sodass der Hubvektor nun durch die Gleichung (A·A^T - m3E)·h = 0 bestimmt wird. Die Lösung dieser Gleichung lautet h = (0; 1.62; 1). Der Knoten 1 hat also einen Hubwert von 0, Knoten 2 hat mit 1.62 den größten Hubwert und Knoten 3 liegt mit einem Wert von 1 in der Mitte. Für den Authorityvektor a wird analog das Eigenwertproblem des Matrixproduktes A^T·A gelöst. Da die Eigenwerte aus Symmetriegründen identisch mit den gerade bestimmten Werten m1 ≈ 0.38, m2 = 1, m3 ≈ 2.62 sind, kann auch direkt auf diese zurückgegriffen werden. Der Authorityvektor hat den Wert a = (1.62; 0; 1)."
  },  
{
    "id": "ea3-Fourierreihe-1",
    "task_type": "RECHENAUFGABE", 
    "aufgabenstellung": "Bestimmen Sie die Fourierreihe der Dreieckfunktion in reeller Darstellung: $$ \\wedge(t)= \\left\\{ \\begin{array}{cc} 1-|t| & |t|<1 \\\\ 0 & sonst \\\\ \\end{array} \\right. $$ Lösung: a0/2 und Rechenweg/Begründung", 
    "musterloesung": "a0/2 = 0,5; Rechenweg/Begründung: $$\\frac{a_0}{2}$$ lautet: $$\\frac{a_0}{2} =  \\frac{1}{T_0} \\int_{t_0}^{t_0+T_0} x(t) \\, dt$$ Dies entspricht dem arithmetischen Mittel über eine Periode, also im Beispiel genau 0,5."
  },
  {
    "id": "ea3-Fourierreihe-2",
    "task_type": "RECHENAUFGABE", 
    "aufgabenstellung": "Bestimmen Sie die Fourierreihe der Dreieckfunktion in reeller Darstellung: $$ \\wedge(t)= \\left\\{ \\begin{array}{cc} 1-|t| & |t|<1 \\\\ 0 & sonst \\\\ \\end{array} \\right. $$ ak und Rechenweg/Begründung", 
    "musterloesung":"$$a_k = \\frac{2 - 2\\cos(\\pi k)}{\\pi^2 k^2} = \\begin{cases} \\dfrac{2}{\\pi^2 k^2}, & k \\\\ \\text{ungerade} \\\\[6pt] 0, & \\text{sonst} \\end{cases}$$; Rechenweg / Begründung: Die Ausgangsformel lautet $$ a_k = \\frac{2}{T_0} \\int_{t_0}^{t_0+T_0} x(t)\\cos(k\\omega_0 t)\\, dt \\quad$$ mit $$\\quad \\omega_0 = \\frac{2\\pi}{T_0} $$ Im konkreten Fall $(T_0 = 2)$ gilt daher $$ a_k = \\int_{-1}^{1} x(t)\\cos(k \\pi t)\\, dt $$ Aus Symmetriegründen genügt es, nur über eine Dreiecksseite zu integrieren und das Ergebnis zu verdoppeln: $$ a_k = 2 \\int_{0}^{1} (1-t)\\cos(k\\pi t)\\, dt $$ Durch Lösung dieses Integrals über partielle Integration kommt man auf das obenstehende Ergebnis."
  },
  {
    "id": "ea3-Fourierreihe-3",
    "task_type": "RECHENAUFGABE", 
    "aufgabenstellung": "Bestimmen Sie die Fourierreihe der Dreieckfunktion in reeller Darstellung: $$ \\wedge(t)= \\left\\{ \\begin{array}{cc} 1-|t| & |t|<1 \\\\ 0 & sonst \\\\ \\end{array} \\right. $$ bk und Rechenweg/Begründung", 
    "musterloesung":"bk = 0; Rechenweg/Begründung:  Die Dreiecksfunktion ist gerade und kann daher keine ungeraden Schwingungsanteile enthalten."
  }, 
   {
    "id": "ea4-huffmann-codierung-1",
    "task_type": "RECHENAUFGABE",
    "aufgabenstellung": "Gegeben sei ein Alphabet A bestehend aus den Symbolen A={S1, S2, S3, S4, S5, S6, S7, S8} mit folgenden Symbolauftrittswahrscheinlichkeiten: S1=0,14, S2=0,18, S3=0,08, S4=0,12, S5=0,32, S6=0,01, S7=0,06, S8=0,09. Wie viele Stellen werden zur Codierung dieses Alphabets mindestens benötigt, wenn ein Code ohne jegliche Komprimierung verwendet wird?",
    "musterloesung":"Lösung: 3 (Wert) Bit (Einheit), Begründung: Es sind 8 Symbole zu kodieren. Dazu werden 3 Binärstellen benötigt (ld 8 = 3)."
  },
  {
    "id": "ea4-huffmann-codierung-3-a",
    "task_type": "RECHENAUFGABE",
    "aufgabenstellung": "S1=100, S2=00, S3=1011, S4=011, S5=11, S6=10100, S7=10101, S8=010.Berechnen Sie die durchschnittliche Codewortlänge für den Code.",
    "musterloesung":" Lösung: 2,72 (Wert) Bit (Einheit). Rechenweg:Für jedes Symbol wird Auftrittswahrscheinlichkeit mit Codewortlänge multipliziert. Dieser Wert wird über alle Symbole summiert.0,14 · 3 Bit + 0,18 · 2 Bit + 0,08 · 4 Bit + 0,12 · 3 Bit + 0,32 · 2 Bit + 0,01 · 5 Bit + 0,06 · 5 Bit + 0,09 · 3 Bit = 2,72"
  },
   {
    "id": "ea4-huffmann-codierung-3-b",
    "task_type": "RECHENAUFGABE",
    "aufgabenstellung": " Um welchen Anteil (prozentual) verringert sich die mittlere Codewortlänge im Vergleich zu der in Aufgabenteil 1 gefundenen Antwort?(2,72 Bit)",
    "musterloesung":" Lösung: 9,3 Prozent, Rechenweg: 3 Bit - 2,72 Bit = 0,28 Bit Verbesserung 0,28 Bit /3 Bit = 0,0933333333333 "
  }
]